
#pragma  once
#include<string.h>
#include<windows.h>
#include<memory.h>
#include<winuser.h>
char* cal_num(char *n,char *t);  //ex. 123-->一百二十三
void convert_digit(char *from,char *to);
static void One2One(char *from, char **to);
extern char ttt[500];  //處理小數點
extern char *digitunit[];

/************************************************************************/
/* 20071002 fable edition                                               */
/************************************************************************/
static unsigned char symbol[96][3] = {"　","！","”","＃","＄","％","＆","’"
,"（","）","＊","＋","，","－","．","／","０","１","２","３","４","５"
,"６","７","８","９","：","；","＜","＝","＞","？","＠","Ａ","Ｂ","Ｃ"
,"Ｄ","Ｅ","Ｆ","Ｇ","Ｈ","Ｉ","Ｊ","Ｋ","Ｌ","Ｍ","Ｎ","Ｏ","Ｐ","Ｑ"
,"Ｒ","Ｓ","Ｔ","Ｕ","Ｖ","Ｗ","Ｘ","Ｙ","Ｚ","〔","＼","〕","︿","ˍ"
,"’","Ａ","Ｂ","Ｃ","Ｄ","Ｅ","Ｆ","Ｇ","Ｈ","Ｉ","Ｊ","Ｋ","Ｌ","Ｍ"
,"Ｎ","Ｏ","Ｐ","Ｑ","Ｒ","Ｓ","Ｔ","Ｕ","Ｖ","Ｗ","Ｘ","Ｙ","Ｚ","｛"
       ,"｜","｝","～","～" } ;
